# Задача №9
# Максимальная цифра в числе
number = input('Введите число: ')
list_number = list(number)
max_number = max(list_number)
print('Максимальная цифра в числе: ',number, 'равна', max_number)